GopalSaraf/Practicals/PSDL/include/proc/pic16f1788.inc
// Register: SSP1CON3
#define SSP1CON3 SSP1CON3
SSP1CON3                                 equ 0217h
// bitfield definitions
SSP1CON3_DHEN_POSN                       equ 0000h
SSP1CON3_DHEN_POSITION                   equ 0000h
SSP1CON3_DHEN_SIZE                       equ 0001h
SSP1CON3_DHEN_LENGTH                     equ 0001h
SSP1CON3_DHEN_MASK                       equ 0001h
SSP1CON3_AHEN_POSN                       equ 0001h
SSP1CON3_AHEN_POSITION                   equ 0001h
SSP1CON3_AHEN_SIZE                       equ 0001h
SSP1CON3_AHEN_LENGTH                     equ 0001h
SSP1CON3_AHEN_MASK                       equ 0002h
SSP1CON3_SBCDE_POSN                      equ 0002h
SSP1CON3_SBCDE_POSITION                  equ 0002h
SSP1CON3_SBCDE_SIZE                      equ 0001h
SSP1CON3_SBCDE_LENGTH                    equ 0001h
SSP1CON3_SBCDE_MASK                      equ 0004h
SSP1CON3_SDAHT_POSN                      equ 0003h
SSP1CON3_SDAHT_POSITION                  equ 0003h
SSP1CON3_SDAHT_SIZE                      equ 0001h
SSP1CON3_SDAHT_LENGTH                    equ 0001h
SSP1CON3_SDAHT_MASK                      equ 0008h
SSP1CON3_BOEN_POSN                       equ 0004h
SSP1CON3_BOEN_POSITION                   equ 0004h
SSP1CON3_BOEN_SIZE                       equ 0001h
SSP1CON3_BOEN_LENGTH                     equ 0001h
SSP1CON3_BOEN_MASK                       equ 0010h
SSP1CON3_SCIE_POSN                       equ 0005h
SSP1CON3_SCIE_POSITION                   equ 0005h
SSP1CON3_SCIE_SIZE                       equ 0001h
SSP1CON3_SCIE_LENGTH                     equ 0001h
SSP1CON3_SCIE_MASK                       equ 0020h
SSP1CON3_PCIE_POSN                       equ 0006h
SSP1CON3_PCIE_POSITION                   equ 0006h
SSP1CON3_PCIE_SIZE                       equ 0001h
SSP1CON3_PCIE_LENGTH                     equ 0001h
SSP1CON3_PCIE_MASK                       equ 0040h
SSP1CON3_ACKTIM_POSN                     equ 0007h
SSP1CON3_ACKTIM_POSITION                 equ 0007h
SSP1CON3_ACKTIM_SIZE                     equ 0001h
SSP1CON3_ACKTIM_LENGTH                   equ 0001h
SSP1CON3_ACKTIM_MASK                     equ 0080h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 028Ch
// bitfield definitions
ODCONA_ODCONA0_POSN                      equ 0000h
ODCONA_ODCONA0_POSITION                  equ 0000h
ODCONA_ODCONA0_SIZE                      equ 0001h
ODCONA_ODCONA0_LENGTH                    equ 0001h
ODCONA_ODCONA0_MASK                      equ 0001h
ODCONA_ODCONA1_POSN                      equ 0001h
ODCONA_ODCONA1_POSITION                  equ 0001h
ODCONA_ODCONA1_SIZE                      equ 0001h
ODCONA_ODCONA1_LENGTH                    equ 0001h
ODCONA_ODCONA1_MASK                      equ 0002h
ODCONA_ODCONA2_POSN                      equ 0002h
ODCONA_ODCONA2_POSITION                  equ 0002h
ODCONA_ODCONA2_SIZE                      equ 0001h
ODCONA_ODCONA2_LENGTH                    equ 0001h
ODCONA_ODCONA2_MASK                      equ 0004h
ODCONA_ODCONA3_POSN                      equ 0003h
ODCONA_ODCONA3_POSITION                  equ 0003h
ODCONA_ODCONA3_SIZE                      equ 0001h
ODCONA_ODCONA3_LENGTH                    equ 0001h
ODCONA_ODCONA3_MASK                      equ 0008h
ODCONA_ODCONA4_POSN                      equ 0004h
ODCONA_ODCONA4_POSITION                  equ 0004h
ODCONA_ODCONA4_SIZE                      equ 0001h
ODCONA_ODCONA4_LENGTH                    equ 0001h
ODCONA_ODCONA4_MASK                      equ 0010h
ODCONA_ODCONA5_POSN                      equ 0005h
ODCONA_ODCONA5_POSITION                  equ 0005h
ODCONA_ODCONA5_SIZE                      equ 0001h
ODCONA_ODCONA5_LENGTH                    equ 0001h
ODCONA_ODCONA5_MASK                      equ 0020h
ODCONA_ODCONA6_POSN                      equ 0006h
ODCONA_ODCONA6_POSITION                  equ 0006h
ODCONA_ODCONA6_SIZE                      equ 0001h
ODCONA_ODCONA6_LENGTH                    equ 0001h
ODCONA_ODCONA6_MASK                      equ 0040h
ODCONA_ODCONA7_POSN                      equ 0007h
ODCONA_ODCONA7_POSITION                  equ 0007h
ODCONA_ODCONA7_SIZE                      equ 0001h
ODCONA_ODCONA7_LENGTH                    equ 0001h
ODCONA_ODCONA7_MASK                      equ 0080h
ODCONA_ODCONA_POSN                       equ 0000h
ODCONA_ODCONA_POSITION                   equ 0000h
ODCONA_ODCONA_SIZE                       equ 0008h
ODCONA_ODCONA_LENGTH                     equ 0008h
ODCONA_ODCONA_MASK                       equ 00FFh

// Register: ODCONB
#define ODCONB ODCONB
ODCONB                                   equ 028Dh
// bitfield definitions
ODCONB_ODCONB0_POSN                      equ 0000h
ODCONB_ODCONB0_POSITION                  equ 0000h
ODCONB_ODCONB0_SIZE                      equ 0001h
ODCONB_ODCONB0_LENGTH                    equ 0001h
ODCONB_ODCONB0_MASK                      equ 0001h
ODCONB_ODCONB1_POSN                      equ 0001h
ODCONB_ODCONB1_POSITION                  equ 0001h
ODCONB_ODCONB1_SIZE                      equ 0001h
ODCONB_ODCONB1_LENGTH                    equ 0001h
ODCONB_ODCONB1_MASK                      equ 0002h
ODCONB_ODCONB2_POSN                      equ 0002h
ODCONB_ODCONB2_POSITION                  equ 0002h
ODCONB_ODCONB2_SIZE                      equ 0001h
ODCONB_ODCONB2_LENGTH                    equ 0001h
ODCONB_ODCONB2_MASK                      equ 0004h
ODCONB_ODCONB3_POSN                      equ 0003h
ODCONB_ODCONB3_POSITION                  equ 0003h
ODCONB_ODCONB3_SIZE                      equ 0001h
ODCONB_ODCONB3_LENGTH                    equ 0001h
ODCONB_ODCONB3_MASK                      equ 0008h
ODCONB_ODCONB4_POSN                      equ 0004h
ODCONB_ODCONB4_POSITION                  equ 0004h
ODCONB_ODCONB4_SIZE                      equ 0001h
ODCONB_ODCONB4_LENGTH                    equ 0001h
ODCONB_ODCONB4_MASK                      equ 0010h
ODCONB_ODCONB5_POSN                      equ 0005h
ODCONB_ODCONB5_POSITION                  equ 0005h
ODCONB_ODCONB5_SIZE                      equ 0001h
ODCONB_ODCONB5_LENGTH                    equ 0001h
ODCONB_ODCONB5_MASK                      equ 0020h
ODCONB_ODCONB6_POSN                      equ 0006h
ODCONB_ODCONB6_POSITION                  equ 0006h
ODCONB_ODCONB6_SIZE                      equ 0001h
ODCONB_ODCONB6_LENGTH                    equ 0001h
ODCONB_ODCONB6_MASK                      equ 0040h
ODCONB_ODCONB7_POSN                      equ 0007h
ODCONB_ODCONB7_POSITION                  equ 0007h
ODCONB_ODCONB7_SIZE                      equ 0001h
ODCONB_ODCONB7_LENGTH                    equ 0001h
ODCONB_ODCONB7_MASK                      equ 0080h
ODCONB_ODCONB_POSN                       equ 0000h
ODCONB_ODCONB_POSITION                   equ 0000h
ODCONB_ODCONB_SIZE                       equ 0008h
ODCONB_ODCONB_LENGTH                     equ 0008h
ODCONB_ODCONB_MASK                       equ 00FFh

// Register: ODCONC
#define ODCONC ODCONC
ODCONC                                   equ 028Eh
// bitfield definitions
ODCONC_ODCONC0_POSN                      equ 0000h
ODCONC_ODCONC0_POSITION                  equ 0000h
ODCONC_ODCONC0_SIZE                      equ 0001h
ODCONC_ODCONC0_LENGTH                    equ 0001h
ODCONC_ODCONC0_MASK                      equ 0001h
ODCONC_ODCONC1_POSN                      equ 0001h
ODCONC_ODCONC1_POSITION                  equ 0001h
ODCONC_ODCONC1_SIZE                      equ 0001h
ODCONC_ODCONC1_LENGTH                    equ 0001h
ODCONC_ODCONC1_MASK                      equ 0002h
ODCONC_ODCONC2_POSN                      equ 0002h
ODCONC_ODCONC2_POSITION                  equ 0002h
ODCONC_ODCONC2_SIZE                      equ 0001h
ODCONC_ODCONC2_LENGTH                    equ 0001h
ODCONC_ODCONC2_MASK                      equ 0004h
ODCONC_ODCONC3_POSN                      equ 0003h
ODCONC_ODCONC3_POSITION                  equ 0003h
ODCONC_ODCONC3_SIZE                      equ 0001h
ODCONC_ODCONC3_LENGTH                    equ 0001h
ODCONC_ODCONC3_MASK                      equ 0008h
ODCONC_ODCONC4_POSN                      equ 0004h
ODCONC_ODCONC4_POSITION                  equ 0004h
ODCONC_ODCONC4_SIZE                      equ 0001h
ODCONC_ODCONC4_LENGTH                    equ 0001h
ODCONC_ODCONC4_MASK                      equ 0010h
ODCONC_ODCONC5_POSN                      equ 0005h
ODCONC_ODCONC5_POSITION                  equ 0005h
ODCONC_ODCONC5_SIZE                      equ 0001h
ODCONC_ODCONC5_LENGTH                    equ 0001h
ODCONC_ODCONC5_MASK                      equ 0020h
ODCONC_ODCONC6_POSN                      equ 0006h
ODCONC_ODCONC6_POSITION                  equ 0006h
ODCONC_ODCONC6_SIZE                      equ 0001h
ODCONC_ODCONC6_LENGTH                    equ 0001h
ODCONC_ODCONC6_MASK                      equ 0040h
ODCONC_ODCONC7_POSN                      equ 0007h
ODCONC_ODCONC7_POSITION                  equ 0007h
ODCONC_ODCONC7_SIZE                      equ 0001h
ODCONC_ODCONC7_LENGTH                    equ 0001h
ODCONC_ODCONC7_MASK                      equ 0080h
ODCONC_ODCONC_POSN                       equ 0000h
ODCONC_ODCONC_POSITION                   equ 0000h
ODCONC_ODCONC_SIZE                       equ 0008h
ODCONC_ODCONC_LENGTH                     equ 0008h
ODCONC_ODCONC_MASK                       equ 00FFh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0291h
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0292h
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0293h
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0298h
// bitfield definitions
CCPR2L_CCPR2L_POSN                       equ 0000h
CCPR2L_CCPR2L_POSITION                   equ 0000h
CCPR2L_CCPR2L_SIZE                       equ 0008h
CCPR2L_CCPR2L_LENGTH                     equ 0008h
CCPR2L_CCPR2L_MASK                       equ 00FFh

