GopalSaraf/Practicals/PSDL/include/proc/pic16f1788.inc
// Register: CCPR2H
#define CCPR2H CCPR2H
CCPR2H                                   equ 0299h
// bitfield definitions
CCPR2H_CCPR2H_POSN                       equ 0000h
CCPR2H_CCPR2H_POSITION                   equ 0000h
CCPR2H_CCPR2H_SIZE                       equ 0008h
CCPR2H_CCPR2H_LENGTH                     equ 0008h
CCPR2H_CCPR2H_MASK                       equ 00FFh

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 029Ah
// bitfield definitions
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h

// Register: SLRCONA
#define SLRCONA SLRCONA
SLRCONA                                  equ 030Ch
// bitfield definitions
SLRCONA_SLRCONA0_POSN                    equ 0000h
SLRCONA_SLRCONA0_POSITION                equ 0000h
SLRCONA_SLRCONA0_SIZE                    equ 0001h
SLRCONA_SLRCONA0_LENGTH                  equ 0001h
SLRCONA_SLRCONA0_MASK                    equ 0001h
SLRCONA_SLRCONA1_POSN                    equ 0001h
SLRCONA_SLRCONA1_POSITION                equ 0001h
SLRCONA_SLRCONA1_SIZE                    equ 0001h
SLRCONA_SLRCONA1_LENGTH                  equ 0001h
SLRCONA_SLRCONA1_MASK                    equ 0002h
SLRCONA_SLRCONA2_POSN                    equ 0002h
SLRCONA_SLRCONA2_POSITION                equ 0002h
SLRCONA_SLRCONA2_SIZE                    equ 0001h
SLRCONA_SLRCONA2_LENGTH                  equ 0001h
SLRCONA_SLRCONA2_MASK                    equ 0004h
SLRCONA_SLRCONA3_POSN                    equ 0003h
SLRCONA_SLRCONA3_POSITION                equ 0003h
SLRCONA_SLRCONA3_SIZE                    equ 0001h
SLRCONA_SLRCONA3_LENGTH                  equ 0001h
SLRCONA_SLRCONA3_MASK                    equ 0008h
SLRCONA_SLRCONA4_POSN                    equ 0004h
SLRCONA_SLRCONA4_POSITION                equ 0004h
SLRCONA_SLRCONA4_SIZE                    equ 0001h
SLRCONA_SLRCONA4_LENGTH                  equ 0001h
SLRCONA_SLRCONA4_MASK                    equ 0010h
SLRCONA_SLRCONA5_POSN                    equ 0005h
SLRCONA_SLRCONA5_POSITION                equ 0005h
SLRCONA_SLRCONA5_SIZE                    equ 0001h
SLRCONA_SLRCONA5_LENGTH                  equ 0001h
SLRCONA_SLRCONA5_MASK                    equ 0020h
SLRCONA_SLRCONA6_POSN                    equ 0006h
SLRCONA_SLRCONA6_POSITION                equ 0006h
SLRCONA_SLRCONA6_SIZE                    equ 0001h
SLRCONA_SLRCONA6_LENGTH                  equ 0001h
SLRCONA_SLRCONA6_MASK                    equ 0040h
SLRCONA_SLRCONA7_POSN                    equ 0007h
SLRCONA_SLRCONA7_POSITION                equ 0007h
SLRCONA_SLRCONA7_SIZE                    equ 0001h
SLRCONA_SLRCONA7_LENGTH                  equ 0001h
SLRCONA_SLRCONA7_MASK                    equ 0080h
SLRCONA_SLRCONA_POSN                     equ 0000h
SLRCONA_SLRCONA_POSITION                 equ 0000h
SLRCONA_SLRCONA_SIZE                     equ 0008h
SLRCONA_SLRCONA_LENGTH                   equ 0008h
SLRCONA_SLRCONA_MASK                     equ 00FFh

// Register: SLRCONB
#define SLRCONB SLRCONB
SLRCONB                                  equ 030Dh
// bitfield definitions
SLRCONB_SLRCONB0_POSN                    equ 0000h
SLRCONB_SLRCONB0_POSITION                equ 0000h
SLRCONB_SLRCONB0_SIZE                    equ 0001h
SLRCONB_SLRCONB0_LENGTH                  equ 0001h
SLRCONB_SLRCONB0_MASK                    equ 0001h
SLRCONB_SLRCONB1_POSN                    equ 0001h
SLRCONB_SLRCONB1_POSITION                equ 0001h
SLRCONB_SLRCONB1_SIZE                    equ 0001h
SLRCONB_SLRCONB1_LENGTH                  equ 0001h
SLRCONB_SLRCONB1_MASK                    equ 0002h
SLRCONB_SLRCONB2_POSN                    equ 0002h
SLRCONB_SLRCONB2_POSITION                equ 0002h
SLRCONB_SLRCONB2_SIZE                    equ 0001h
SLRCONB_SLRCONB2_LENGTH                  equ 0001h
SLRCONB_SLRCONB2_MASK                    equ 0004h
SLRCONB_SLRCONB3_POSN                    equ 0003h
SLRCONB_SLRCONB3_POSITION                equ 0003h
SLRCONB_SLRCONB3_SIZE                    equ 0001h
SLRCONB_SLRCONB3_LENGTH                  equ 0001h
SLRCONB_SLRCONB3_MASK                    equ 0008h
SLRCONB_SLRCONB4_POSN                    equ 0004h
SLRCONB_SLRCONB4_POSITION                equ 0004h
SLRCONB_SLRCONB4_SIZE                    equ 0001h
SLRCONB_SLRCONB4_LENGTH                  equ 0001h
SLRCONB_SLRCONB4_MASK                    equ 0010h
SLRCONB_SLRCONB5_POSN                    equ 0005h
SLRCONB_SLRCONB5_POSITION                equ 0005h
SLRCONB_SLRCONB5_SIZE                    equ 0001h
SLRCONB_SLRCONB5_LENGTH                  equ 0001h
SLRCONB_SLRCONB5_MASK                    equ 0020h
SLRCONB_SLRCONB6_POSN                    equ 0006h
SLRCONB_SLRCONB6_POSITION                equ 0006h
SLRCONB_SLRCONB6_SIZE                    equ 0001h
SLRCONB_SLRCONB6_LENGTH                  equ 0001h
SLRCONB_SLRCONB6_MASK                    equ 0040h
SLRCONB_SLRCONB7_POSN                    equ 0007h
SLRCONB_SLRCONB7_POSITION                equ 0007h
SLRCONB_SLRCONB7_SIZE                    equ 0001h
SLRCONB_SLRCONB7_LENGTH                  equ 0001h
SLRCONB_SLRCONB7_MASK                    equ 0080h
SLRCONB_SLRCONB_POSN                     equ 0000h
SLRCONB_SLRCONB_POSITION                 equ 0000h
SLRCONB_SLRCONB_SIZE                     equ 0008h
SLRCONB_SLRCONB_LENGTH                   equ 0008h
SLRCONB_SLRCONB_MASK                     equ 00FFh

// Register: SLRCONC
#define SLRCONC SLRCONC
SLRCONC                                  equ 030Eh
// bitfield definitions
SLRCONC_SLRCONC0_POSN                    equ 0000h
SLRCONC_SLRCONC0_POSITION                equ 0000h
SLRCONC_SLRCONC0_SIZE                    equ 0001h
SLRCONC_SLRCONC0_LENGTH                  equ 0001h
SLRCONC_SLRCONC0_MASK                    equ 0001h
SLRCONC_SLRCONC1_POSN                    equ 0001h
SLRCONC_SLRCONC1_POSITION                equ 0001h
SLRCONC_SLRCONC1_SIZE                    equ 0001h
SLRCONC_SLRCONC1_LENGTH                  equ 0001h
SLRCONC_SLRCONC1_MASK                    equ 0002h
SLRCONC_SLRCONC2_POSN                    equ 0002h
SLRCONC_SLRCONC2_POSITION                equ 0002h
SLRCONC_SLRCONC2_SIZE                    equ 0001h
SLRCONC_SLRCONC2_LENGTH                  equ 0001h
SLRCONC_SLRCONC2_MASK                    equ 0004h
SLRCONC_SLRCONC3_POSN                    equ 0003h
SLRCONC_SLRCONC3_POSITION                equ 0003h
SLRCONC_SLRCONC3_SIZE                    equ 0001h
SLRCONC_SLRCONC3_LENGTH                  equ 0001h
SLRCONC_SLRCONC3_MASK                    equ 0008h
SLRCONC_SLRCONC4_POSN                    equ 0004h
SLRCONC_SLRCONC4_POSITION                equ 0004h
SLRCONC_SLRCONC4_SIZE                    equ 0001h
SLRCONC_SLRCONC4_LENGTH                  equ 0001h
SLRCONC_SLRCONC4_MASK                    equ 0010h
SLRCONC_SLRCONC5_POSN                    equ 0005h
SLRCONC_SLRCONC5_POSITION                equ 0005h
SLRCONC_SLRCONC5_SIZE                    equ 0001h
SLRCONC_SLRCONC5_LENGTH                  equ 0001h
SLRCONC_SLRCONC5_MASK                    equ 0020h
SLRCONC_SLRCONC6_POSN                    equ 0006h
SLRCONC_SLRCONC6_POSITION                equ 0006h
SLRCONC_SLRCONC6_SIZE                    equ 0001h
SLRCONC_SLRCONC6_LENGTH                  equ 0001h
SLRCONC_SLRCONC6_MASK                    equ 0040h
SLRCONC_SLRCONC7_POSN                    equ 0007h
SLRCONC_SLRCONC7_POSITION                equ 0007h
SLRCONC_SLRCONC7_SIZE                    equ 0001h
SLRCONC_SLRCONC7_LENGTH                  equ 0001h
SLRCONC_SLRCONC7_MASK                    equ 0080h
SLRCONC_SLRCONC_POSN                     equ 0000h
SLRCONC_SLRCONC_POSITION                 equ 0000h
SLRCONC_SLRCONC_SIZE                     equ 0008h
SLRCONC_SLRCONC_LENGTH                   equ 0008h
SLRCONC_SLRCONC_MASK                     equ 00FFh

