GopalSaraf/Practicals/PSDL/include/proc/pic16f1788.inc
#define P4PHSC2                          BANKMASK(PSMC4PHS), 2
#define P4PHSC3                          BANKMASK(PSMC4PHS), 3
#define P4PHSC4                          BANKMASK(PSMC4PHS), 4
#define P4PHSIN                          BANKMASK(PSMC4PHS), 7
#define P4PHST                           BANKMASK(PSMC4PHS), 0
#define P4POFST                          BANKMASK(PSMC4SYNC), 7
#define P4POLA                           BANKMASK(PSMC4POL), 0
#define P4POLB                           BANKMASK(PSMC4POL), 1
#define P4PRPOL                          BANKMASK(PSMC4SYNC), 6
#define P4PRSC1                          BANKMASK(PSMC4PRS), 1
#define P4PRSC2                          BANKMASK(PSMC4PRS), 2
#define P4PRSC3                          BANKMASK(PSMC4PRS), 3
#define P4PRSC4                          BANKMASK(PSMC4PRS), 4
#define P4PRSIN                          BANKMASK(PSMC4PRS), 7
#define P4PRST                           BANKMASK(PSMC4PRS), 0
#define P4REBM0                          BANKMASK(PSMC4BLNK), 0
#define P4REBM1                          BANKMASK(PSMC4BLNK), 1
#define P4REBSC1                         BANKMASK(PSMC4REBS), 1
#define P4REBSC2                         BANKMASK(PSMC4REBS), 2
#define P4REBSC3                         BANKMASK(PSMC4REBS), 3
#define P4REBSC4                         BANKMASK(PSMC4REBS), 4
#define P4REBSIN                         BANKMASK(PSMC4REBS), 7
#define P4SSYNC                          BANKMASK(PSMC4STR1), 7
#define P4STRA                           BANKMASK(PSMC4STR0), 0
#define P4STRB                           BANKMASK(PSMC4STR0), 1
#define P4SYNC0                          BANKMASK(PSMC4SYNC), 0
#define P4SYNC1                          BANKMASK(PSMC4SYNC), 1
#define P4SYNC2                          BANKMASK(PSMC4SYNC), 2
#define P4TDCIE                          BANKMASK(PSMC4INT), 5
#define P4TDCIF                          BANKMASK(PSMC4INT), 1
#define P4TOVIE                          BANKMASK(PSMC4INT), 7
#define P4TOVIF                          BANKMASK(PSMC4INT), 3
#define P4TPHIE                          BANKMASK(PSMC4INT), 6
#define P4TPHIF                          BANKMASK(PSMC4INT), 2
#define P4TPRIE                          BANKMASK(PSMC4INT), 4
#define P4TPRIF                          BANKMASK(PSMC4INT), 0
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PMSC3TIE                         BANKMASK(PIE4), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSMC1BLKF0                       BANKMASK(PSMC1BLKF), 0
#define PSMC1BLKF1                       BANKMASK(PSMC1BLKF), 1
#define PSMC1BLKF2                       BANKMASK(PSMC1BLKF), 2
#define PSMC1BLKF3                       BANKMASK(PSMC1BLKF), 3
#define PSMC1BLKF4                       BANKMASK(PSMC1BLKF), 4
#define PSMC1BLKF5                       BANKMASK(PSMC1BLKF), 5
#define PSMC1BLKF6                       BANKMASK(PSMC1BLKF), 6
#define PSMC1BLKF7                       BANKMASK(PSMC1BLKF), 7
#define PSMC1BLKR0                       BANKMASK(PSMC1BLKR), 0
#define PSMC1BLKR1                       BANKMASK(PSMC1BLKR), 1
#define PSMC1BLKR2                       BANKMASK(PSMC1BLKR), 2
#define PSMC1BLKR3                       BANKMASK(PSMC1BLKR), 3
#define PSMC1BLKR4                       BANKMASK(PSMC1BLKR), 4
#define PSMC1BLKR5                       BANKMASK(PSMC1BLKR), 5
#define PSMC1BLKR6                       BANKMASK(PSMC1BLKR), 6
#define PSMC1BLKR7                       BANKMASK(PSMC1BLKR), 7
#define PSMC1DBF0                        BANKMASK(PSMC1DBF), 0
#define PSMC1DBF1                        BANKMASK(PSMC1DBF), 1
#define PSMC1DBF2                        BANKMASK(PSMC1DBF), 2
#define PSMC1DBF3                        BANKMASK(PSMC1DBF), 3
#define PSMC1DBF4                        BANKMASK(PSMC1DBF), 4
#define PSMC1DBF5                        BANKMASK(PSMC1DBF), 5
#define PSMC1DBF6                        BANKMASK(PSMC1DBF), 6
#define PSMC1DBF7                        BANKMASK(PSMC1DBF), 7
#define PSMC1DBR0                        BANKMASK(PSMC1DBR), 0
#define PSMC1DBR1                        BANKMASK(PSMC1DBR), 1
#define PSMC1DBR2                        BANKMASK(PSMC1DBR), 2
#define PSMC1DBR3                        BANKMASK(PSMC1DBR), 3
#define PSMC1DBR4                        BANKMASK(PSMC1DBR), 4
#define PSMC1DBR5                        BANKMASK(PSMC1DBR), 5
#define PSMC1DBR6                        BANKMASK(PSMC1DBR), 6
#define PSMC1DBR7                        BANKMASK(PSMC1DBR), 7
#define PSMC1DC0                         BANKMASK(PSMC1DCL), 0
#define PSMC1DC1                         BANKMASK(PSMC1DCL), 1
#define PSMC1DC10                        BANKMASK(PSMC1DCH), 2
#define PSMC1DC11                        BANKMASK(PSMC1DCH), 3
#define PSMC1DC12                        BANKMASK(PSMC1DCH), 4
#define PSMC1DC13                        BANKMASK(PSMC1DCH), 5
#define PSMC1DC14                        BANKMASK(PSMC1DCH), 6
#define PSMC1DC15                        BANKMASK(PSMC1DCH), 7
#define PSMC1DC2                         BANKMASK(PSMC1DCL), 2
#define PSMC1DC3                         BANKMASK(PSMC1DCL), 3
#define PSMC1DC4                         BANKMASK(PSMC1DCL), 4
#define PSMC1DC5                         BANKMASK(PSMC1DCL), 5
#define PSMC1DC6                         BANKMASK(PSMC1DCL), 6
#define PSMC1DC7                         BANKMASK(PSMC1DCL), 7
#define PSMC1DC8                         BANKMASK(PSMC1DCH), 0
#define PSMC1DC9                         BANKMASK(PSMC1DCH), 1
#define PSMC1EN                          BANKMASK(PSMC1CON), 7
#define PSMC1FFA0                        BANKMASK(PSMC1FFA), 0
#define PSMC1FFA1                        BANKMASK(PSMC1FFA), 1
#define PSMC1FFA2                        BANKMASK(PSMC1FFA), 2
#define PSMC1FFA3                        BANKMASK(PSMC1FFA), 3
#define PSMC1LD                          BANKMASK(PSMC1CON), 6
#define PSMC1PH0                         BANKMASK(PSMC1PHL), 0
#define PSMC1PH1                         BANKMASK(PSMC1PHL), 1
#define PSMC1PH10                        BANKMASK(PSMC1PHH), 2
#define PSMC1PH11                        BANKMASK(PSMC1PHH), 3
#define PSMC1PH12                        BANKMASK(PSMC1PHH), 4
#define PSMC1PH13                        BANKMASK(PSMC1PHH), 5
#define PSMC1PH14                        BANKMASK(PSMC1PHH), 6
#define PSMC1PH15                        BANKMASK(PSMC1PHH), 7
#define PSMC1PH2                         BANKMASK(PSMC1PHL), 2
#define PSMC1PH3                         BANKMASK(PSMC1PHL), 3
#define PSMC1PH4                         BANKMASK(PSMC1PHL), 4
#define PSMC1PH5                         BANKMASK(PSMC1PHL), 5
#define PSMC1PH6                         BANKMASK(PSMC1PHL), 6
#define PSMC1PH7                         BANKMASK(PSMC1PHL), 7
#define PSMC1PH8                         BANKMASK(PSMC1PHH), 0
#define PSMC1PH9                         BANKMASK(PSMC1PHH), 1
#define PSMC1PR0                         BANKMASK(PSMC1PRL), 0
#define PSMC1PR1                         BANKMASK(PSMC1PRL), 1
#define PSMC1PR10                        BANKMASK(PSMC1PRH), 2
#define PSMC1PR11                        BANKMASK(PSMC1PRH), 3
#define PSMC1PR12                        BANKMASK(PSMC1PRH), 4
#define PSMC1PR13                        BANKMASK(PSMC1PRH), 5
#define PSMC1PR14                        BANKMASK(PSMC1PRH), 6
#define PSMC1PR15                        BANKMASK(PSMC1PRH), 7
#define PSMC1PR2                         BANKMASK(PSMC1PRL), 2
#define PSMC1PR3                         BANKMASK(PSMC1PRL), 3
#define PSMC1PR4                         BANKMASK(PSMC1PRL), 4
#define PSMC1PR5                         BANKMASK(PSMC1PRL), 5
#define PSMC1PR6                         BANKMASK(PSMC1PRL), 6
#define PSMC1PR7                         BANKMASK(PSMC1PRL), 7
#define PSMC1PR8                         BANKMASK(PSMC1PRH), 0
#define PSMC1PR9                         BANKMASK(PSMC1PRH), 1
#define PSMC1SIE                         BANKMASK(PIE4), 0
#define PSMC1SIF                         BANKMASK(PIR4), 0
#define PSMC1TIE                         BANKMASK(PIE4), 4
#define PSMC1TIF                         BANKMASK(PIR4), 4
#define PSMC1TMR0                        BANKMASK(PSMC1TMRL), 0
#define PSMC1TMR1                        BANKMASK(PSMC1TMRL), 1
#define PSMC1TMR10                       BANKMASK(PSMC1TMRH), 2
#define PSMC1TMR11                       BANKMASK(PSMC1TMRH), 3
#define PSMC1TMR12                       BANKMASK(PSMC1TMRH), 4
#define PSMC1TMR13                       BANKMASK(PSMC1TMRH), 5
#define PSMC1TMR14                       BANKMASK(PSMC1TMRH), 6
#define PSMC1TMR15                       BANKMASK(PSMC1TMRH), 7
#define PSMC1TMR2                        BANKMASK(PSMC1TMRL), 2
#define PSMC1TMR3                        BANKMASK(PSMC1TMRL), 3
#define PSMC1TMR4                        BANKMASK(PSMC1TMRL), 4
#define PSMC1TMR5                        BANKMASK(PSMC1TMRL), 5
#define PSMC1TMR6                        BANKMASK(PSMC1TMRL), 6
#define PSMC1TMR7                        BANKMASK(PSMC1TMRL), 7
#define PSMC1TMR8                        BANKMASK(PSMC1TMRH), 0
#define PSMC1TMR9                        BANKMASK(PSMC1TMRH), 1
#define PSMC2BLKF0                       BANKMASK(PSMC2BLKF), 0
#define PSMC2BLKF1                       BANKMASK(PSMC2BLKF), 1
#define PSMC2BLKF2                       BANKMASK(PSMC2BLKF), 2
#define PSMC2BLKF3                       BANKMASK(PSMC2BLKF), 3
#define PSMC2BLKF4                       BANKMASK(PSMC2BLKF), 4
#define PSMC2BLKF5                       BANKMASK(PSMC2BLKF), 5
#define PSMC2BLKF6                       BANKMASK(PSMC2BLKF), 6
#define PSMC2BLKF7                       BANKMASK(PSMC2BLKF), 7
#define PSMC2BLKR0                       BANKMASK(PSMC2BLKR), 0
#define PSMC2BLKR1                       BANKMASK(PSMC2BLKR), 1
#define PSMC2BLKR2                       BANKMASK(PSMC2BLKR), 2
#define PSMC2BLKR3                       BANKMASK(PSMC2BLKR), 3
#define PSMC2BLKR4                       BANKMASK(PSMC2BLKR), 4
#define PSMC2BLKR5                       BANKMASK(PSMC2BLKR), 5
#define PSMC2BLKR6                       BANKMASK(PSMC2BLKR), 6
#define PSMC2BLKR7                       BANKMASK(PSMC2BLKR), 7
#define PSMC2DBF0                        BANKMASK(PSMC2DBF), 0
#define PSMC2DBF1                        BANKMASK(PSMC2DBF), 1
#define PSMC2DBF2                        BANKMASK(PSMC2DBF), 2
#define PSMC2DBF3                        BANKMASK(PSMC2DBF), 3
#define PSMC2DBF4                        BANKMASK(PSMC2DBF), 4
#define PSMC2DBF5                        BANKMASK(PSMC2DBF), 5
#define PSMC2DBF6                        BANKMASK(PSMC2DBF), 6
#define PSMC2DBF7                        BANKMASK(PSMC2DBF), 7
#define PSMC2DBR0                        BANKMASK(PSMC2DBR), 0
#define PSMC2DBR1                        BANKMASK(PSMC2DBR), 1
#define PSMC2DBR2                        BANKMASK(PSMC2DBR), 2
#define PSMC2DBR3                        BANKMASK(PSMC2DBR), 3
#define PSMC2DBR4                        BANKMASK(PSMC2DBR), 4
#define PSMC2DBR5                        BANKMASK(PSMC2DBR), 5
#define PSMC2DBR6                        BANKMASK(PSMC2DBR), 6
#define PSMC2DBR7                        BANKMASK(PSMC2DBR), 7
#define PSMC2DC0                         BANKMASK(PSMC2DCL), 0
#define PSMC2DC1                         BANKMASK(PSMC2DCL), 1
#define PSMC2DC10                        BANKMASK(PSMC2DCH), 2
#define PSMC2DC11                        BANKMASK(PSMC2DCH), 3
#define PSMC2DC12                        BANKMASK(PSMC2DCH), 4
#define PSMC2DC13                        BANKMASK(PSMC2DCH), 5
#define PSMC2DC14                        BANKMASK(PSMC2DCH), 6
#define PSMC2DC15                        BANKMASK(PSMC2DCH), 7
#define PSMC2DC2                         BANKMASK(PSMC2DCL), 2
#define PSMC2DC3                         BANKMASK(PSMC2DCL), 3
#define PSMC2DC4                         BANKMASK(PSMC2DCL), 4
#define PSMC2DC5                         BANKMASK(PSMC2DCL), 5
#define PSMC2DC6                         BANKMASK(PSMC2DCL), 6
#define PSMC2DC7                         BANKMASK(PSMC2DCL), 7
#define PSMC2DC8                         BANKMASK(PSMC2DCH), 0
#define PSMC2DC9                         BANKMASK(PSMC2DCH), 1
#define PSMC2EN                          BANKMASK(PSMC2CON), 7
#define PSMC2FFA0                        BANKMASK(PSMC2FFA), 0
#define PSMC2FFA1                        BANKMASK(PSMC2FFA), 1
#define PSMC2FFA2                        BANKMASK(PSMC2FFA), 2
#define PSMC2FFA3                        BANKMASK(PSMC2FFA), 3
#define PSMC2LD                          BANKMASK(PSMC2CON), 6
#define PSMC2PH0                         BANKMASK(PSMC2PHL), 0
#define PSMC2PH1                         BANKMASK(PSMC2PHL), 1
#define PSMC2PH10                        BANKMASK(PSMC2PHH), 2
#define PSMC2PH11                        BANKMASK(PSMC2PHH), 3
#define PSMC2PH12                        BANKMASK(PSMC2PHH), 4
#define PSMC2PH13                        BANKMASK(PSMC2PHH), 5
#define PSMC2PH14                        BANKMASK(PSMC2PHH), 6
#define PSMC2PH15                        BANKMASK(PSMC2PHH), 7
#define PSMC2PH2                         BANKMASK(PSMC2PHL), 2
#define PSMC2PH3                         BANKMASK(PSMC2PHL), 3
#define PSMC2PH4                         BANKMASK(PSMC2PHL), 4
#define PSMC2PH5                         BANKMASK(PSMC2PHL), 5
#define PSMC2PH6                         BANKMASK(PSMC2PHL), 6
#define PSMC2PH7                         BANKMASK(PSMC2PHL), 7
#define PSMC2PH8                         BANKMASK(PSMC2PHH), 0
#define PSMC2PH9                         BANKMASK(PSMC2PHH), 1
#define PSMC2PR0                         BANKMASK(PSMC2PRL), 0
#define PSMC2PR1                         BANKMASK(PSMC2PRL), 1
#define PSMC2PR10                        BANKMASK(PSMC2PRH), 2
#define PSMC2PR11                        BANKMASK(PSMC2PRH), 3
#define PSMC2PR12                        BANKMASK(PSMC2PRH), 4
#define PSMC2PR13                        BANKMASK(PSMC2PRH), 5
#define PSMC2PR14                        BANKMASK(PSMC2PRH), 6
#define PSMC2PR15                        BANKMASK(PSMC2PRH), 7
#define PSMC2PR2                         BANKMASK(PSMC2PRL), 2
#define PSMC2PR3                         BANKMASK(PSMC2PRL), 3
#define PSMC2PR4                         BANKMASK(PSMC2PRL), 4
#define PSMC2PR5                         BANKMASK(PSMC2PRL), 5
#define PSMC2PR6                         BANKMASK(PSMC2PRL), 6
#define PSMC2PR7                         BANKMASK(PSMC2PRL), 7
#define PSMC2PR8                         BANKMASK(PSMC2PRH), 0
#define PSMC2PR9                         BANKMASK(PSMC2PRH), 1
#define PSMC2SIE                         BANKMASK(PIE4), 1
#define PSMC2SIF                         BANKMASK(PIR4), 1
#define PSMC2TIE                         BANKMASK(PIE4), 5
#define PSMC2TIF                         BANKMASK(PIR4), 5
#define PSMC2TMR0                        BANKMASK(PSMC2TMRL), 0
#define PSMC2TMR1                        BANKMASK(PSMC2TMRL), 1
#define PSMC2TMR10                       BANKMASK(PSMC2TMRH), 2
#define PSMC2TMR11                       BANKMASK(PSMC2TMRH), 3
#define PSMC2TMR12                       BANKMASK(PSMC2TMRH), 4
#define PSMC2TMR13                       BANKMASK(PSMC2TMRH), 5
#define PSMC2TMR14                       BANKMASK(PSMC2TMRH), 6
#define PSMC2TMR15                       BANKMASK(PSMC2TMRH), 7
#define PSMC2TMR2                        BANKMASK(PSMC2TMRL), 2
#define PSMC2TMR3                        BANKMASK(PSMC2TMRL), 3
#define PSMC2TMR4                        BANKMASK(PSMC2TMRL), 4
#define PSMC2TMR5                        BANKMASK(PSMC2TMRL), 5
#define PSMC2TMR6                        BANKMASK(PSMC2TMRL), 6
#define PSMC2TMR7                        BANKMASK(PSMC2TMRL), 7
#define PSMC2TMR8                        BANKMASK(PSMC2TMRH), 0
#define PSMC2TMR9                        BANKMASK(PSMC2TMRH), 1
#define PSMC3BLKF0                       BANKMASK(PSMC3BLKF), 0
#define PSMC3BLKF1                       BANKMASK(PSMC3BLKF), 1
#define PSMC3BLKF2                       BANKMASK(PSMC3BLKF), 2
#define PSMC3BLKF3                       BANKMASK(PSMC3BLKF), 3
#define PSMC3BLKF4                       BANKMASK(PSMC3BLKF), 4
#define PSMC3BLKF5                       BANKMASK(PSMC3BLKF), 5
#define PSMC3BLKF6                       BANKMASK(PSMC3BLKF), 6
#define PSMC3BLKF7                       BANKMASK(PSMC3BLKF), 7
#define PSMC3BLKR0                       BANKMASK(PSMC3BLKR), 0
#define PSMC3BLKR1                       BANKMASK(PSMC3BLKR), 1
#define PSMC3BLKR2                       BANKMASK(PSMC3BLKR), 2
#define PSMC3BLKR3                       BANKMASK(PSMC3BLKR), 3
#define PSMC3BLKR4                       BANKMASK(PSMC3BLKR), 4
#define PSMC3BLKR5                       BANKMASK(PSMC3BLKR), 5
#define PSMC3BLKR6                       BANKMASK(PSMC3BLKR), 6
#define PSMC3BLKR7                       BANKMASK(PSMC3BLKR), 7
#define PSMC3DBF0                        BANKMASK(PSMC3DBF), 0
#define PSMC3DBF1                        BANKMASK(PSMC3DBF), 1
#define PSMC3DBF2                        BANKMASK(PSMC3DBF), 2
#define PSMC3DBF3                        BANKMASK(PSMC3DBF), 3
#define PSMC3DBF4                        BANKMASK(PSMC3DBF), 4
#define PSMC3DBF5                        BANKMASK(PSMC3DBF), 5
#define PSMC3DBF6                        BANKMASK(PSMC3DBF), 6
#define PSMC3DBF7                        BANKMASK(PSMC3DBF), 7
#define PSMC3DBR0                        BANKMASK(PSMC3DBR), 0
#define PSMC3DBR1                        BANKMASK(PSMC3DBR), 1
#define PSMC3DBR2                        BANKMASK(PSMC3DBR), 2
#define PSMC3DBR3                        BANKMASK(PSMC3DBR), 3
#define PSMC3DBR4                        BANKMASK(PSMC3DBR), 4
#define PSMC3DBR5                        BANKMASK(PSMC3DBR), 5
#define PSMC3DBR6                        BANKMASK(PSMC3DBR), 6
#define PSMC3DBR7                        BANKMASK(PSMC3DBR), 7
#define PSMC3DC0                         BANKMASK(PSMC3DCL), 0
#define PSMC3DC1                         BANKMASK(PSMC3DCL), 1
#define PSMC3DC10                        BANKMASK(PSMC3DCH), 2
#define PSMC3DC11                        BANKMASK(PSMC3DCH), 3
#define PSMC3DC12                        BANKMASK(PSMC3DCH), 4
#define PSMC3DC13                        BANKMASK(PSMC3DCH), 5
#define PSMC3DC14                        BANKMASK(PSMC3DCH), 6
#define PSMC3DC15                        BANKMASK(PSMC3DCH), 7
#define PSMC3DC2                         BANKMASK(PSMC3DCL), 2
#define PSMC3DC3                         BANKMASK(PSMC3DCL), 3
#define PSMC3DC4                         BANKMASK(PSMC3DCL), 4
#define PSMC3DC5                         BANKMASK(PSMC3DCL), 5
#define PSMC3DC6                         BANKMASK(PSMC3DCL), 6
#define PSMC3DC7                         BANKMASK(PSMC3DCL), 7
#define PSMC3DC8                         BANKMASK(PSMC3DCH), 0
#define PSMC3DC9                         BANKMASK(PSMC3DCH), 1
#define PSMC3EN                          BANKMASK(PSMC3CON), 7
#define PSMC3FFA0                        BANKMASK(PSMC3FFA), 0
#define PSMC3FFA1                        BANKMASK(PSMC3FFA), 1
#define PSMC3FFA2                        BANKMASK(PSMC3FFA), 2
#define PSMC3FFA3                        BANKMASK(PSMC3FFA), 3
#define PSMC3LD                          BANKMASK(PSMC3CON), 6
#define PSMC3PH0                         BANKMASK(PSMC3PHL), 0
#define PSMC3PH1                         BANKMASK(PSMC3PHL), 1
#define PSMC3PH10                        BANKMASK(PSMC3PHH), 2
#define PSMC3PH11                        BANKMASK(PSMC3PHH), 3
#define PSMC3PH12                        BANKMASK(PSMC3PHH), 4
#define PSMC3PH13                        BANKMASK(PSMC3PHH), 5
#define PSMC3PH14                        BANKMASK(PSMC3PHH), 6
#define PSMC3PH15                        BANKMASK(PSMC3PHH), 7
#define PSMC3PH2                         BANKMASK(PSMC3PHL), 2
#define PSMC3PH3                         BANKMASK(PSMC3PHL), 3
#define PSMC3PH4                         BANKMASK(PSMC3PHL), 4
#define PSMC3PH5                         BANKMASK(PSMC3PHL), 5
#define PSMC3PH6                         BANKMASK(PSMC3PHL), 6
#define PSMC3PH7                         BANKMASK(PSMC3PHL), 7
#define PSMC3PH8                         BANKMASK(PSMC3PHH), 0
#define PSMC3PH9                         BANKMASK(PSMC3PHH), 1
#define PSMC3PR0                         BANKMASK(PSMC3PRL), 0
#define PSMC3PR1                         BANKMASK(PSMC3PRL), 1
#define PSMC3PR10                        BANKMASK(PSMC3PRH), 2
#define PSMC3PR11                        BANKMASK(PSMC3PRH), 3
#define PSMC3PR12                        BANKMASK(PSMC3PRH), 4
#define PSMC3PR13                        BANKMASK(PSMC3PRH), 5
#define PSMC3PR14                        BANKMASK(PSMC3PRH), 6
#define PSMC3PR15                        BANKMASK(PSMC3PRH), 7
#define PSMC3PR2                         BANKMASK(PSMC3PRL), 2
#define PSMC3PR3                         BANKMASK(PSMC3PRL), 3
#define PSMC3PR4                         BANKMASK(PSMC3PRL), 4
#define PSMC3PR5                         BANKMASK(PSMC3PRL), 5
#define PSMC3PR6                         BANKMASK(PSMC3PRL), 6
#define PSMC3PR7                         BANKMASK(PSMC3PRL), 7
#define PSMC3PR8                         BANKMASK(PSMC3PRH), 0
#define PSMC3PR9                         BANKMASK(PSMC3PRH), 1
#define PSMC3SIE                         BANKMASK(PIE4), 2
#define PSMC3SIF                         BANKMASK(PIR4), 2
#define PSMC3TIE                         BANKMASK(PIE4), 6
#define PSMC3TIF                         BANKMASK(PIR4), 6
#define PSMC3TMR0                        BANKMASK(PSMC3TMRL), 0
#define PSMC3TMR1                        BANKMASK(PSMC3TMRL), 1
#define PSMC3TMR10                       BANKMASK(PSMC3TMRH), 2
#define PSMC3TMR11                       BANKMASK(PSMC3TMRH), 3
#define PSMC3TMR12                       BANKMASK(PSMC3TMRH), 4
#define PSMC3TMR13                       BANKMASK(PSMC3TMRH), 5
#define PSMC3TMR14                       BANKMASK(PSMC3TMRH), 6
#define PSMC3TMR15                       BANKMASK(PSMC3TMRH), 7
#define PSMC3TMR2                        BANKMASK(PSMC3TMRL), 2
#define PSMC3TMR3                        BANKMASK(PSMC3TMRL), 3
#define PSMC3TMR4                        BANKMASK(PSMC3TMRL), 4
#define PSMC3TMR5                        BANKMASK(PSMC3TMRL), 5
#define PSMC3TMR6                        BANKMASK(PSMC3TMRL), 6
#define PSMC3TMR7                        BANKMASK(PSMC3TMRL), 7
#define PSMC3TMR8                        BANKMASK(PSMC3TMRH), 0
#define PSMC3TMR9                        BANKMASK(PSMC3TMRH), 1
#define PSMC4BLKF0                       BANKMASK(PSMC4BLKF), 0
#define PSMC4BLKF1                       BANKMASK(PSMC4BLKF), 1
#define PSMC4BLKF2                       BANKMASK(PSMC4BLKF), 2
#define PSMC4BLKF3                       BANKMASK(PSMC4BLKF), 3
#define PSMC4BLKF4                       BANKMASK(PSMC4BLKF), 4
#define PSMC4BLKF5                       BANKMASK(PSMC4BLKF), 5
#define PSMC4BLKF6                       BANKMASK(PSMC4BLKF), 6
#define PSMC4BLKF7                       BANKMASK(PSMC4BLKF), 7
#define PSMC4BLKR0                       BANKMASK(PSMC4BLKR), 0
#define PSMC4BLKR1                       BANKMASK(PSMC4BLKR), 1
#define PSMC4BLKR2                       BANKMASK(PSMC4BLKR), 2
#define PSMC4BLKR3                       BANKMASK(PSMC4BLKR), 3
#define PSMC4BLKR4                       BANKMASK(PSMC4BLKR), 4
#define PSMC4BLKR5                       BANKMASK(PSMC4BLKR), 5
#define PSMC4BLKR6                       BANKMASK(PSMC4BLKR), 6
#define PSMC4BLKR7                       BANKMASK(PSMC4BLKR), 7
