GopalSaraf/Practicals/PSDL/include/proc/pic16f1788.inc
#define PSMC4DBF0                        BANKMASK(PSMC4DBF), 0
#define PSMC4DBF1                        BANKMASK(PSMC4DBF), 1
#define PSMC4DBF2                        BANKMASK(PSMC4DBF), 2
#define PSMC4DBF3                        BANKMASK(PSMC4DBF), 3
#define PSMC4DBF4                        BANKMASK(PSMC4DBF), 4
#define PSMC4DBF5                        BANKMASK(PSMC4DBF), 5
#define PSMC4DBF6                        BANKMASK(PSMC4DBF), 6
#define PSMC4DBF7                        BANKMASK(PSMC4DBF), 7
#define PSMC4DBR0                        BANKMASK(PSMC4DBR), 0
#define PSMC4DBR1                        BANKMASK(PSMC4DBR), 1
#define PSMC4DBR2                        BANKMASK(PSMC4DBR), 2
#define PSMC4DBR3                        BANKMASK(PSMC4DBR), 3
#define PSMC4DBR4                        BANKMASK(PSMC4DBR), 4
#define PSMC4DBR5                        BANKMASK(PSMC4DBR), 5
#define PSMC4DBR6                        BANKMASK(PSMC4DBR), 6
#define PSMC4DBR7                        BANKMASK(PSMC4DBR), 7
#define PSMC4DC0                         BANKMASK(PSMC4DCL), 0
#define PSMC4DC1                         BANKMASK(PSMC4DCL), 1
#define PSMC4DC10                        BANKMASK(PSMC4DCH), 2
#define PSMC4DC11                        BANKMASK(PSMC4DCH), 3
#define PSMC4DC12                        BANKMASK(PSMC4DCH), 4
#define PSMC4DC13                        BANKMASK(PSMC4DCH), 5
#define PSMC4DC14                        BANKMASK(PSMC4DCH), 6
#define PSMC4DC15                        BANKMASK(PSMC4DCH), 7
#define PSMC4DC2                         BANKMASK(PSMC4DCL), 2
#define PSMC4DC3                         BANKMASK(PSMC4DCL), 3
#define PSMC4DC4                         BANKMASK(PSMC4DCL), 4
#define PSMC4DC5                         BANKMASK(PSMC4DCL), 5
#define PSMC4DC6                         BANKMASK(PSMC4DCL), 6
#define PSMC4DC7                         BANKMASK(PSMC4DCL), 7
#define PSMC4DC8                         BANKMASK(PSMC4DCH), 0
#define PSMC4DC9                         BANKMASK(PSMC4DCH), 1
#define PSMC4EN                          BANKMASK(PSMC4CON), 7
#define PSMC4FFA0                        BANKMASK(PSMC4FFA), 0
#define PSMC4FFA1                        BANKMASK(PSMC4FFA), 1
#define PSMC4FFA2                        BANKMASK(PSMC4FFA), 2
#define PSMC4FFA3                        BANKMASK(PSMC4FFA), 3
#define PSMC4LD                          BANKMASK(PSMC4CON), 6
#define PSMC4PH0                         BANKMASK(PSMC4PHL), 0
#define PSMC4PH1                         BANKMASK(PSMC4PHL), 1
#define PSMC4PH10                        BANKMASK(PSMC4PHH), 2
#define PSMC4PH11                        BANKMASK(PSMC4PHH), 3
#define PSMC4PH12                        BANKMASK(PSMC4PHH), 4
#define PSMC4PH13                        BANKMASK(PSMC4PHH), 5
#define PSMC4PH14                        BANKMASK(PSMC4PHH), 6
#define PSMC4PH15                        BANKMASK(PSMC4PHH), 7
#define PSMC4PH2                         BANKMASK(PSMC4PHL), 2
#define PSMC4PH3                         BANKMASK(PSMC4PHL), 3
#define PSMC4PH4                         BANKMASK(PSMC4PHL), 4
#define PSMC4PH5                         BANKMASK(PSMC4PHL), 5
#define PSMC4PH6                         BANKMASK(PSMC4PHL), 6
#define PSMC4PH7                         BANKMASK(PSMC4PHL), 7
#define PSMC4PH8                         BANKMASK(PSMC4PHH), 0
#define PSMC4PH9                         BANKMASK(PSMC4PHH), 1
#define PSMC4PR0                         BANKMASK(PSMC4PRL), 0
#define PSMC4PR1                         BANKMASK(PSMC4PRL), 1
#define PSMC4PR10                        BANKMASK(PSMC4PRH), 2
#define PSMC4PR11                        BANKMASK(PSMC4PRH), 3
#define PSMC4PR12                        BANKMASK(PSMC4PRH), 4
#define PSMC4PR13                        BANKMASK(PSMC4PRH), 5
#define PSMC4PR14                        BANKMASK(PSMC4PRH), 6
#define PSMC4PR15                        BANKMASK(PSMC4PRH), 7
#define PSMC4PR2                         BANKMASK(PSMC4PRL), 2
#define PSMC4PR3                         BANKMASK(PSMC4PRL), 3
#define PSMC4PR4                         BANKMASK(PSMC4PRL), 4
#define PSMC4PR5                         BANKMASK(PSMC4PRL), 5
#define PSMC4PR6                         BANKMASK(PSMC4PRL), 6
#define PSMC4PR7                         BANKMASK(PSMC4PRL), 7
#define PSMC4PR8                         BANKMASK(PSMC4PRH), 0
#define PSMC4PR9                         BANKMASK(PSMC4PRH), 1
#define PSMC4SIE                         BANKMASK(PIE4), 3
#define PSMC4SIF                         BANKMASK(PIR4), 3
#define PSMC4TIE                         BANKMASK(PIE4), 7
#define PSMC4TIF                         BANKMASK(PIR4), 7
#define PSMC4TMR0                        BANKMASK(PSMC4TMRL), 0
#define PSMC4TMR1                        BANKMASK(PSMC4TMRL), 1
#define PSMC4TMR10                       BANKMASK(PSMC4TMRH), 2
#define PSMC4TMR11                       BANKMASK(PSMC4TMRH), 3
#define PSMC4TMR12                       BANKMASK(PSMC4TMRH), 4
#define PSMC4TMR13                       BANKMASK(PSMC4TMRH), 5
#define PSMC4TMR14                       BANKMASK(PSMC4TMRH), 6
#define PSMC4TMR15                       BANKMASK(PSMC4TMRH), 7
#define PSMC4TMR2                        BANKMASK(PSMC4TMRL), 2
#define PSMC4TMR3                        BANKMASK(PSMC4TMRL), 3
#define PSMC4TMR4                        BANKMASK(PSMC4TMRL), 4
#define PSMC4TMR5                        BANKMASK(PSMC4TMRL), 5
#define PSMC4TMR6                        BANKMASK(PSMC4TMRL), 6
#define PSMC4TMR7                        BANKMASK(PSMC4TMRL), 7
#define PSMC4TMR8                        BANKMASK(PSMC4TMRH), 0
#define PSMC4TMR9                        BANKMASK(PSMC4TMRH), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RE3                              BANKMASK(PORTE), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define RXSEL                            BANKMASK(APFCON1), 1
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCKSEL                           BANKMASK(APFCON1), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SDISEL                           BANKMASK(APFCON1), 3
#define SDOSEL                           BANKMASK(APFCON1), 5
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRCONA0                         BANKMASK(SLRCONA), 0
#define SLRCONA1                         BANKMASK(SLRCONA), 1
#define SLRCONA2                         BANKMASK(SLRCONA), 2
#define SLRCONA3                         BANKMASK(SLRCONA), 3
#define SLRCONA4                         BANKMASK(SLRCONA), 4
#define SLRCONA5                         BANKMASK(SLRCONA), 5
#define SLRCONA6                         BANKMASK(SLRCONA), 6
#define SLRCONA7                         BANKMASK(SLRCONA), 7
#define SLRCONB0                         BANKMASK(SLRCONB), 0
#define SLRCONB1                         BANKMASK(SLRCONB), 1
#define SLRCONB2                         BANKMASK(SLRCONB), 2
#define SLRCONB3                         BANKMASK(SLRCONB), 3
#define SLRCONB4                         BANKMASK(SLRCONB), 4
#define SLRCONB5                         BANKMASK(SLRCONB), 5
#define SLRCONB6                         BANKMASK(SLRCONB), 6
#define SLRCONB7                         BANKMASK(SLRCONB), 7
#define SLRCONC0                         BANKMASK(SLRCONC), 0
#define SLRCONC1                         BANKMASK(SLRCONC), 1
#define SLRCONC2                         BANKMASK(SLRCONC), 2
#define SLRCONC3                         BANKMASK(SLRCONC), 3
#define SLRCONC4                         BANKMASK(SLRCONC), 4
#define SLRCONC5                         BANKMASK(SLRCONC), 5
#define SLRCONC6                         BANKMASK(SLRCONC), 6
#define SLRCONC7                         BANKMASK(SLRCONC), 7
#define SMP                              BANKMASK(SSP1STAT), 7
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TX1STA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1OSCR                           BANKMASK(OSCSTAT), 7
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TRIGSEL0                         BANKMASK(ADCON2), 4
#define TRIGSEL1                         BANKMASK(ADCON2), 5
#define TRIGSEL2                         BANKMASK(ADCON2), 6
#define TRIGSEL3                         BANKMASK(ADCON2), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISE3                           BANKMASK(TRISE), 3
#define TRMT                             BANKMASK(TX1STA), 1
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX9                              BANKMASK(TX1STA), 6
#define TX9D                             BANKMASK(TX1STA), 0
#define TXEN                             BANKMASK(TX1STA), 5
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define TXSEL                            BANKMASK(APFCON1), 2
#define UA                               BANKMASK(SSP1STAT), 1
#define VREGPM                           BANKMASK(VREGCON), 1
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WDTPS4                           BANKMASK(WDTCON), 5
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUA6                            BANKMASK(WPUA), 6
#define WPUA7                            BANKMASK(WPUA), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
#define WPUB2                            BANKMASK(WPUB), 2
#define WPUB3                            BANKMASK(WPUB), 3
#define WPUB4                            BANKMASK(WPUB), 4
#define WPUB5                            BANKMASK(WPUB), 5
#define WPUB6                            BANKMASK(WPUB), 6
#define WPUB7                            BANKMASK(WPUB), 7
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC5                            BANKMASK(WPUC), 5
#define WPUC6                            BANKMASK(WPUC), 6
#define WPUC7                            BANKMASK(WPUC), 7
#define WPUE3                            BANKMASK(WPUE), 3
#define WR                               BANKMASK(EECON1), 1
#define WREN                             BANKMASK(EECON1), 2
#define WRERR                            BANKMASK(EECON1), 3
#define WUE                              BANKMASK(BAUD1CON), 1
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nBOR                             BANKMASK(PCON), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRI                              BANKMASK(PCON), 2
#define nRMCLR                           BANKMASK(PCON), 3
#define nRWDT                            BANKMASK(PCON), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWPUEN                           BANKMASK(OPTION_REG), 7

